Tekla Open API Reference for Tekla Structures 2025
InputObjectDependencyAttribute Constructor
Overload List
Name | Description
InputObjectDependencyAttribute(Int32)
 The custom attribute [InputObjectDependency(PluginBase.InputObjectDependency Type)] uses this to store a dependency attribute which determines when the plug-in is updated in the system. This is not to be used by itself.
InputObjectDependencyAttribute(PluginBase.InputObjectDependency)
 The custom attribute [InputObjectDependency(PluginBase.InputObjectDependency Type)] uses this to store a dependency attribute which determines when the plug-in is updated in the system. This is not to be used by itself.
Top
See Also
Reference
InputObjectDependencyAttribute Class
Tekla.Structures.Plugins Namespace